HEBREW_KEYWORDS = \
	['הבנה','הבעה','לשון','מילה','דרכי התצורה','נטייה','תקינות','תבנית','התצורה','אוצר מילים','תחביר','חלקי הדיבור','צירופים שמניים',
	 'משפט','משפטים','מבנים תחביריים','תפקיד תקשורתי','הבעה','כתיבה','סיכום','כתיבת טיעון','טיעון','צירוף','כבול','חופשי','משפט','טקסט',
	 'הקשר','מערכת הצורות','צורה','צורות','תחביר','פועל','שם','תואר','השורשים','שורש','בניינים','בניין','משקלים','משקל','תורת ההגה','הגה','דקדוק'
		,'מבנה','גזירה','נטייה','נטיה','הטיות','צורן','צורנים','פונולוגיה','עיצורים','תנועות','פונמה','פונמות','דגש','קמץ','פתח','חיריק','סגול','קובוץ','שורוק','מפיק',
     'חטף','שווא','צירה','צרה','גוף','מין','מספר','ריבוי','נקבה','זכר','עבר','עתיד','הווה','זוגי','ציווי','בינוני','פעול','פעל','נפעל','התפעל',
     'פיעל','הפעיל','הופעל','שייכות','נסמך','סמיכות','גזרות','בנייני הפועל','משקלי השם','שם הפועל','פעולה','שם פעולה','בסיס','צורן','הרכב',
     'הלחם','רשאי תיבות','"ר\"ת"','שם המספר','תבנית','מוספית','"חז\"ל"','מסורגת','קטל','קטלת','מקטל','קטיל','משמעות','"פ\"נ"','"ל\"א"','"ע\"ו"'
		,'קווית','זמן','תקינות',' יסודי','סידורי','סתמי','חלקי','שוואים','חטפים','נע','נח','מרחף','דיפתונג','הידמות','גרוני','היקש','ל״י','סופי','סופית','תחילית',
     'בכלם','"בכל\"מ"','"בכל\"ם"','בכלמ','קטלן','מקרא','חז״ל','גיזרון','גיזרונה','מילון','גלגול','צירופים','מילים','דיוק','טקסטואלי','עגה','דיבור','כתיבה'
		,'לעז','משלב','סמנטי','אגרון','סלנג','קונוטציה','מטפורה','מטונימיה','ניב','בידול','היכללות','הומונימיה','הומופוניה ','הומוגרפיה','לקסיקולוגיה','לקסיקוגרפיה',
     'שפה','ניקוד','שמני','נרדפ','נרדף','חלק דיבור','ניב','עממי','פורמלי','תזאורוס','רטורי','קונוטציה','קטול','פוליסמיה','אידיומטי','קולוקציות','בידול'
		,'סגנון','ניגוד','הגייה','שחבור','יחס','יידוע','מבע','נושא','נשוא','אגוד','מושא','לוואי','תמורה','תיאור','הצרכה','הסגר','פנייה','איחוי','מורכב','פסוקית','ייחוד'
		,'סתמיות','התאם','פיסוק','טפל','מיליות','מילית','כינוי','רמז','חבור','ידיעה','ישיר','עקיף','תיאור','תואר','תפקיד','פעיל','סביל','משמעי','דיאלוג','תקבולת',
     'עיבוי','הכללה','פירוט','הדגשה','סתמיות','מתמשכת','חזרה','טיפולוגיה','עיוני','על פה','"בע\"פ"','על-פה','סוגה','נימה',
     'אינטונציה','גלוי','סמוי','משתמע','ממזג','עריכה','קביל','אנציקלופדי','עיתונאי','מכתב','תעמולה','ספירלי','מאמר','כרזה','הרצאה','נאום','שיחה'
		,'כותרת','משנה','נקרא','היצג','מטפוריקה','סמנטי','מפתח','מקור','נימוק','נתמך','טענה','ביסוס','תרגום','רטורי','תיאור','עצם','צליל','גזרות','ח.פ.נ',
     'חפ"נ','נ.פ.ה','נפ"ה','סיכול','צורה','צורת','ניקוד','שלמים','נחי','אותיות','אות','צלילים','דימוי','נל"ה','נ.ל.ה','נפיו','נפי"ו','נ.פ.י.ו','חפנ',
     'נפה','נלה']


MATH_KEYWORDS = ['גיאומטריה','אוקלידית ','טריגונומטרי','מישור','פולינומ','פולינום','שורש','ריבועי','פונקצי','רציונאליות','רציונליות','אנליטית','קטע','מרחק','נקוד',
                 'אורך','אמצע','ישר','משווא','שיפוע','הקבלה','מקביל','חיתוך','ניצב','מעגל','מלבן','ריבוע','מצולע','מעוין','מרובע','משולש','דלתון','מקבילית',
                 'מרכז','ראשית','ציר','אלגבר','פירוק','גורמ','גורם','משותף','נוסחא','כפל','חיבור','חיסור','חלוקה','חילוק','חזקה','עצרת','טרינום','מקוצר','שבר'
	,'אי-שוויו','מעלה ראשונה','מעלה שנייה','מעלה שניה','משתנה','משתנים','נעלם','פרמטר','פתרון','יחיד','אינסוף','גרף','גרפ','מתלכד','חקיר','אי-רציונ',
	             'הצבה','אינטגרל','נגזרת','f(x) ','g(x) ','x','y','לינארי','מעריכי','לוגרית','מנה','מכנה','מונה','דיפרנציאלי','אחוזים','הספק','סדרות ','סדרה '
	,'חשבונית','נוסח','נסיגה','איבר','סכום','כלל לפי מקום','כלל נסיגה','הנדס','סופי','הסתברות','אקראיות','מרחב','מאורע','תלויים','בלתי תלוי','מותנית','בייס',
	             'טבלאות','טבלה','טבלות','טבלא','עץ','עצים','בינומית','התפלגות','ברנולי','קומבינטוריקה','שטח','היקף','חפיפ','משפט','הוכחה','תיכון',
	             'חוצה','פיתגורס','תאלס','נובע','טענה','יחס','דמיון','היקפים','שטחים','תיכונים','גובה','גבהים','חוצי','רדיוס','חסום','חסומים','חוסם','חוסמים'
	,'דומים','פרופורצי','זווית','קהה','ממוצע','חציון','תוחלת','היטל','יתר','קשת','מיתר','היקפיות','משיק','חיצוני','מקומות גיאומטרי','מקום גיאומטרי','אנך',
	             'כולא','צמודה','משלימ','משלים','צלע','קודקוד','פיאה','פיאות','טריגונומטריה','מחזור','גזרה','מעלות','רדיא','סינוס','קוסינוס','טנגנס','sin',
	             'cos','tan','atan','arctan','log','ln','שטוח','ישרה','ערכ','ערך','חיתוך','מקסימום','מינימום','קיצון','פיתול','גזירה','חיוביות','שליליות',
	             'עלייה','ירידה','הזז','מתיח','פירוק','זהות','שויו','שוויו','העלאה','הוצא','=','+','/','*','0','1','2','3','4','5','6','7','8','9','מוחלט'
	,'קעיר','קמיר','קעור','קמור','אפס','אחת','שתיים','שלוש','ארבע','חמש','שש','שבע','שמונה','תשע','עשר','מינוס','פלוס','כפול','חלקי','שווה','פתוח',
	             'סגור','הגדרה','תחום','קוביה','קובייה','תיבה','פירמידה','גליל','כדור','מנסרה','פנים','מעטפת','אסימפטוט','קבוע','בחם','בח"ם','בחמ',
	             'בח"מ','מסוים','נפח','חיצונית','פנימי','סיבוב','וקטור','ווקטור','גדילה','דעיכה ','מעריך','בסיס','חץ','חיצים','חצים','תכונות','תכונה','קומבינציה'
	,'צירוף','צירופ','סקלר','הדדי','מצטלב','מישור','משופע','מרוכבים','דמיוני','ממשי','שלילי','צמוד','נגדי','הופכי','גאוס','פרבול','אליפסה','עקומ','עקום',
	             'מוקד','דיסקרימיננטה','דטרמיננטה','מלבן','מחצית','חצי','רבע','שליש','חמישית','עשירית','מליונית','אלף','מאה','מליון','מיליארד','אלפ','גבול'
	,'>','<','%','אינטגר','קצב','שוקיים','סטטיסטי','שכיחות','שכיחות','דיאגרמ','טבעי','מדעי','ריבית','טרפז','חרוט','קונוס','נורמלי','תקן','תנועה','מהירות',
	             'דרך','מכירה','מחיר','תשלום','הנחה','גזירה','גזיר','קנוני','נימוק','חותך','נחתך','נחתכ','קדקוד','בהתאמה','תחום','תחומ','סתמי','סתום',
	             'קדומה','קדומות','היחידה','לגזור','נגזרות','זווית','משוואות','הx','הy','נעלמים','נקודה','נקודות','שורשים','מערכת','ישרים','מקבילים','אסימפטוטות'
	,'אסימפטוטה','אופקי','אופקיות','אופקיים','אנכי','אנכיים','צמצום','לצמצם','לוג','לוגים','פונקציה','מתאפס','מתאפסת','לופיטל','מאפס','חור','כחור','מציב',
	             'מציבה','מציבים','ערכים','איקס','שואף','הצבה','שואפת','טריגו','תציב','תציבי','תציבו','תרגיל','הצבות','ביטוי','חשוד','חשודים','חשודות','פרבולה'
	,'פרבולות',',ישרים','חיובי','במינוס','בפלוס','בפונקציה','אופקית','פונקציות','רדיאן','רדיאנים','מחשבון','נגזרת','גזרנו','גזרתי','אגזור','לפונקציה','אינטגרלים',
	             'בחזקה','בחזקת','שוויון','שרטוט','סרטוט','לגורמים','ראשוני','e','פאי','אסמפטוטה','אסמפטוטות','אקס','גזרת','סוגריים','בסוגריים','בנוסחא',
	             'מעריכית','להוכיח','נק','מכפילים','מחברים','מחסרים','מחלקים','מוציאים','וקטורים','גאומטריים','מקדם','מקדמים','להתלכד',
				 'x','y','z','=']



ENCOURAGE_KEYWORDS = ["מעולה", "מצוין", "נהדר", "כל הכבוד", "יפה", "מצויין", "👍", "מדויק", "מדוייק", "אין כמוך","גאון",
                      "תותח", "אין עליך", "תותחים", "תותחיות", "גאונים", "גאונות", "מעולות", "מעולים", "גאה", "אלופות",
                      "אלופים", "צודק", "צודקת", "צודקים", "צודקות", "אחלה", "גדולה", "גדול", "גדולים", "גדולות"]

QUESTION_KEYWORDS = ["כיצד", "באיזה", "מדוע", "למה", "כמה", "איך", "איזה", "איפה", "האם", "מה", "מהו"]

ACK_KEYWORDS = ['הבנתי','תודה','אחלה','סבבה','יופי','טוב',"👍"]

THE_PREFIX = ''

GENERAL_PREFIXES = ['ה']

GENERAL_SUFFIXES = ['.','?',',']

NEGATIVE_PREFIXES = ['אל','לא']


#TODO: Add prefixes and suffixes

HEBREW = 'HEBREW'
MATH = 'MATH'
ENCOURAGE = 'ENCOURAGE'
QUESTION = 'QUESTION'
ACK = 'ACK'

WORDS_PARAMS={HEBREW:{'keywords':HEBREW_KEYWORDS},
              MATH:{'keywords':MATH_KEYWORDS},
              ENCOURAGE:{'keywords':ENCOURAGE_KEYWORDS,'math_to_remove':["גדולה","גדול","גדולים","גדולות"]},
              QUESTION:{'keywords':QUESTION_KEYWORDS},
              ACK:{'keywords':ACK_KEYWORDS,'specific_suffixes':['!']}}


def is_in_msg(word,msg):
	if ' {} '.format(word) in msg:
		return True
	if msg.startswith(word) or msg.endswith(word):
		return True
	return False


def is_word_in_msg(word,msg,prefixes,suffixes):
	if is_in_msg(word,msg):
		return True
	for prefix in prefixes:
		if is_in_msg(' {}{} '.format(prefix,word),msg):
			return True
	for suffix in suffixes:
		if is_in_msg(' {}{} '.format(word,suffix),msg):
			return True
	return False


def isnt_really_in_msg(word,msg,negative_prefixes):
	for prefix in negative_prefixes:
		if ' {} {} '.format(prefix,word) in msg:
			return True
	return False


def get_words_to_remove(keyword_type, group_type):
	if group_type==MATH:
		return WORDS_PARAMS[keyword_type].get('math_to_remove','[]')
	else:
		return []


def count_words(msg,keyword_type,group_type,is_debug=False):
	keywords = WORDS_PARAMS.get(keyword_type).get('keywords')
	specific_prefixes = WORDS_PARAMS.get(keyword_type).get('specific_prefixes',[])
	specific_suffixes = WORDS_PARAMS.get(keyword_type).get('specific_suffixes',[])

	prefixes = specific_prefixes + GENERAL_PREFIXES
	suffixes = specific_suffixes + GENERAL_SUFFIXES

	keywords_to_remove = get_words_to_remove(keyword_type,group_type)

	for key in keywords_to_remove:
		if key in keywords:
			keywords.remove(key)

	count = 0
	found_words = []
	for word in keywords:
		# Check for whole words - with space before and after
		if is_word_in_msg(word,msg,prefixes,suffixes) and not isnt_really_in_msg(word,msg,NEGATIVE_PREFIXES):
			count += 1
			found_words.append(word)

	if count>0:
		if is_debug:
			print('TYPE: {}, MSG: {}, words: {}'.format(keyword_type, msg,found_words))

	return count
